    echo -e "\e[31m ██████ \e[33m▄▄▄█████▓ \e[32m██▀███  \e[36m▓█████   \e[34m ██████   \e[35m██████ \e[0m"
    echo -e "\e[31m▒██    ▒ \e[33m▓  ██▒ ▓▒\e[32m▓██ ▒ ██▒\e[36m▓█   ▀ \e[34m▒██    ▒ \e[35m▒██    ▒ \e[0m"
    echo -e "\e[31m░ ▓██▄   \e[33m▒ ▓██░ ▒░\e[32m▓██ ░▄█ ▒\e[36m▒███   \e[34m░ ▓██▄   \e[35m░ ▓██▄   \e[0m"
    echo -e "\e[31m  ▒   ██▒\e[33m░ ▓██▓ ░ \e[32m▒██▀▀█▄  \e[36m▒▓█  ▄   \e[34m▒   ██▒  \e[35m▒   ██▒\e[0m"
    echo -e "\e[31m▒██████▒▒\e[33m  ▒██▒ ░ \e[32m░██▓ ▒██▒\e[36m░▒████▒\e[34m▒██████▒▒\e[35m▒██████▒▒\e[0m"
    echo -e "\e[31m▒ ▒▓▒ ▒ ░\e[33m  ▒ ░░   \e[32m░░▒▓ ░▒▓░\e[36m░░ ▒░ ░\e[34m▒ ▒▓▒ ▒ ░\e[35m▒ ▒▓▒ ▒ ░\e[0m"
    echo -e "\e[31m░ ░▒  ░ ░\e[33m    ░    \e[32m ░░▒ ░ ▒░\e[36m ░ ░  ░\e[34m░ ░▒  ░ ░\e[35m░ ░▒  ░ ░\e[0m"
    echo -e "\e[31m░  ░  ░  \e[33m   ░      \e[32m ░   ░  \e[36m  ░    ░ \e[34m ░  ░  \e[35m   ░  ░  \e[0m"
    echo -e "\e[31m      ░  \e[33m   ░    \e[32m       ░  \e[36m   ░   \e[34m       ░ \e[35m      ░  \e[0m"
echo -e "111"

#!/bin/bash

text=(
"  ██████ ▄▄▄█████▓ ██▀███  ▓█████   ██████   ██████ "
"▒██    ▒ ▓  ██▒ ▓▒▓██ ▒ ██▒▓█   ▀ ▒██    ▒ ▒██    ▒ "
"░ ▓██▄   ▒ ▓██░ ▒░▓██ ░▄█ ▒▒███   ░ ▓██▄   ░ ▓██▄   "
"  ▒   ██▒░ ▓██▓ ░ ▒██▀▀█▄  ▒▓█  ▄   ▒   ██▒  ▒   ██▒"
"▒██████▒▒  ▒██▒ ░ ░██▓ ▒██▒░▒████▒▒██████▒▒▒██████▒▒"
"▒ ▒▓▒ ▒ ░  ▒ ░░   ░ ▒▓ ░▒▓░░░ ▒░ ░▒ ▒▓▒ ▒ ░▒ ▒▓▒ ▒ ░"
"░ ░▒  ░ ░    ░      ░▒ ░ ▒░ ░ ░  ░░ ░▒  ░ ░░ ░▒  ░ ░"
"░  ░  ░    ░        ░░   ░    ░   ░  ░  ░  ░  ░  ░  "
"      ░              ░        ░  ░      ░        ░  "
)

# Массив цветов ANSI (код цвета - цифра после \e[ )
colors=(31 32 33 34 35 36 91 92 93 94 95 96)

# Функция для рандомного цвета из массива colors
rand_color() {
  echo ${colors[$RANDOM % ${#colors[@]}]}
}

# Вариант 1: каждый символ случайного цвета
color_variant_1() {
  for line in "${text[@]}"; do
    for ((i=0; i<${#line}; i++)); do
      char="${line:$i:1}"
      c=$(rand_color)
      echo -ne "\e[${c}m${char}\e[0m"
    done
    echo
  done
}
